#include<stdio.h>
int main() {
    int A[10]={1,2,3,4,5,6,7,8,9,10};
    int B[10]={2,3,4,5,6,7,8,9,10,11};
    int C[10]={0};
    for (int i = 0; i<10; i++ ){ // элементы массива С - сумма соответствующих элементов массивов А и В
        C[i]= A[i]+B[i];
    }
    int max=0, cnt =0, sumC=0;
    float cntC=0.0;
    for (int i = 0; i<10; i++ ){ 
        if ((i%2==0) && (A[i]>max)) { // поиск максимальной реальной части комплексных чисел массива A
            max = A[i];
        } 
        if ((i%2==1) && (B[i]<0)){ //поиск количества мнимых частей, которые меньше 0 в массиве B. 
            cnt +=1;
        } 
        
        sumC += C[i]; //сумма всех элементов С
        cntC += 1;

    }
    printf("Максимальное реальное в A = %d, количество мнемых частей, меьше 0 в B = %d\n ", max, cnt);
    printf(" среднне арифметическое С = %lf\n ", sumC/cntC);




}
